---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewSurfacesMode
source: html/7c61e427-7348-6e07-a435-4f2fb3011dc4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewSurfacesMode Property

"Show Surfaces"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewSurfacesMode { get; }
```